
// { Controller
Процедура КомандаНалево(Кнопка)
	//ЭтотОбъект.ПоворнутьНалево();
КонецПроцедуры

Процедура КомандаНаправо(Кнопка)
	ЭтотОбъект.ПовернутьНаправо();
КонецПроцедуры
// }

// { View
Процедура Отрисовать()
	ЭлементыФормы.ПолеТабличногоДокумента1.Область(1, 1, ЭтотОбъект.ВысотаПоля, ЭтотОбъект.ШиринаПоля).Текст = "";
	ГоловаЗмейки = ЭтотОбъект.Змейка.Тело[0];
	ЭлементыФормы.ПолеТабличногоДокумента1.Область(ГоловаЗмейки.Y, ГоловаЗмейки.X).Текст = "О";
	Для Сч = 1 По ЭтотОбъект.Змейка.Тело.Количество() - 1 Цикл
		ЧастьЗмейки = ЭтотОбъект.Змейка.Тело[Сч];
		ЭлементыФормы.ПолеТабличногоДокумента1.Область(ЧастьЗмейки.Y, ЧастьЗмейки.X).Текст = "[]";
	КонецЦикла;
	//ЭлементыФормы.ПолеТабличногоДокумента1.Область(Еда.Y, Еда.X).Текст = "Е";
КонецПроцедуры
// }

// { Game loop
Процедура ФиксированноеОбновление()
	Если ЭтотОбъект.Состояние = ЭтотОбъект.ВозможныеСостоянияИгры().Играем Тогда
		ЭтотОбъект.СделатьХод();
		
		Отрисовать();
		
		ПодключитьОбработчикОжидания("ФиксированноеОбновление", 0.1, Истина);
	//ИначеЕсли ЭтотОбъект.Состояние = ЭтотОбъект.ВозможныеСостояния().КонецИгры Тогда
	//	Предупреждение("Конец игры");
	КонецЕсли;
КонецПроцедуры
// }

Процедура НоваяИграНажатие(Элемент)
	ЭтотОбъект.Инициализировать();
	ПодключитьОбработчикОжидания("ФиксированноеОбновление", 0.1, Истина);
КонецПроцедуры

НоваяИграНажатие(Неопределено);